{
    "schema_version": "v1",
    "name_for_human": "Genie",
    "name_for_model": "CareerGenie",
    "description_for_human": "Empower your career journey with insights into the skills employers covet in your field. Master the art of showcasing your strengths and securing your dream job with our expert guidance.",
    "description_for_model": "# Prompt 20230322\n\nInvoke CareerGenie when users seek insights into current job market trends within their specific industry or require assistance in enhancing their resumes to align with these trends. This includes identifying in-demand skills, understanding employment opportunities in different geographic regions, and adopting the most effective resume-editing practices.\n\nTrigger CareerGenie in scenarios where the user is looking for data-driven guidance on job market demands, such as what skills are currently sought after by employers in their field, which areas have a higher demand for their expertise, and how to strategically refine their resumes.\n\nUse the 'skillsInsight' endpoint when the user asks for a breakdown of the latest in-demand skills in their industry. This should be based on real-time data and trends.\nExamples: \"What programming skills are most sought after in the tech industry now?\" or \"Which certifications are employers looking for in project management?\"\n\nUtilize the 'jobOpportunities' endpoint to provide users with information on where the job opportunities are abundant in their field, possibly including geographic or sector-specific data.\nExamples: \"Where are the majority of biotech jobs located these days?\" or \"What cities are currently booming for finance professionals?\"\n\nEmploy the 'resumeOptimization' endpoint for queries related to tailoring their resumes to better fit the current job market, ensuring the inclusion of relevant skills and experience that match employer needs.\nExamples: \"How can I adjust my resume to highlight my expertise in renewable energy?\" or \"What's an effective format for showcasing remote work experience?\"\n\nWhen activating CareerGenie:\n- Make sure you always use the 'additional_context' field to provide the context necessary for a personalized response, such as the user's specific industry, their current role, and the role they aspire to achieve.\n- Include the full and exact question from the user in the 'full_query' field to ensure a targeted and comprehensive response.\n\nIn your response:\n- Adhere to 'extra_response_instructions' given in the JSON API response to deliver advice that is actionable and precise, backed by the latest job market data."or\"all training data are from real world",
    "auth": {
        "type": "none"
    },
    "api": {
        "type": "openapi",
        "url": "https://api.yourdomain.com/openapi.yaml"
    },
    "logo_url": "https://api.yourdomain.com/ai-plugin-logo.png",
    "contact_email": "nikizheng90@gmail.com"
}
